DataProcessors/ЗагрузкаБюджетаИзФайла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаБюджетаИзФайла</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДНаправленияДеятельности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>110</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеНаправленияДеятельности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусНаправленияДеятельности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДСтатьиДДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>110</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеСтатьиДДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусСтатьиДДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКвартал1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКвартал2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКвартал3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКвартал4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаМесяц12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеНаправленияДеятельности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеСтатьиДДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДДСНайденоПоУИД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельностиНайденоПоУИД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьДубли</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьНовыеСтроки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НайденнаяСтрока</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаСтатей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИДГруппыСтатей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>110</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеГруппыСтатей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаСтатейНайденоПоУИД</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерНаправленияДеятельности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ВидСтатьиДвиженияДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидСтатьиДвиженияДенег</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходРасход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ЗагрузкаБюджетаИзФайла/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Документ") Тогда	
		ВызватьИсключение НСтр("ru = 'Обработка не предназначена для непосредственного использования.'");
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	АдресФайла = Параметры.АдресФайла;
	ДокументБюджета = Параметры.Документ; 
	ДанныеФайла = Параметры.ТабличныйДокумент;  
	НужнаКорректировка  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБюджета, "Утвержден"); 
	Детализация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументБюджета, "Детализация"); 
	
	Если Детализация = Перечисления.Периодичность.Квартал Тогда
		ИмяПериода = "СуммаКвартал";
		КоличествоПериодов = 4;
	Иначе 
		ИмяПериода = "СуммаМесяц";
		КоличествоПериодов = 12;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(АдресФайла) Или Не ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		ТекстИсключения = НСтр("ru = 'Не выбран файл для загрузки.
		|Откройте обработку из формы бюджета с помощью команды ""Загрузить из Excel"".'");
		ВызватьИсключение ТекстИсключения;
	КонецЕсли;
	
	ОписаниеКолонок.Загрузить(Обработки.ЗагрузкаБюджетаИзФайла.ОписаниеЗагружаемыхКолонок(Детализация));
	Элементы.ГруппаШаг1.Видимость = Ложь;
	Элементы.ГруппаШаг2.Видимость = Ложь;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТабличнаяЧастьИзменена = Ложь;
	ПодключитьОбработчикОжидания("Подключаемый_ПодготовитьТабличныйДокумент", 0.1, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ОтборТаблицы = 0;
	Для Каждого СтрокаТаблицы Из Объект.Бюджет Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.СтатьяДДС) И ПустаяСтрока(СтрокаТаблицы.НаименованиеСтатьиДДС) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Статья доходов и расходов"); 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.НаправлениеДеятельности) И ПустаяСтрока(СтрокаТаблицы.НаименованиеНаправленияДеятельности) 
			И СтрокаТаблицы.Раздел = "Расход" Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение", "Направление деятельности");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;
		
		Если СтрокаТаблицы.ЕстьДубли Тогда
			Если СтрокаТаблицы.СтатусСтатьиДДС = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусДубль() Тогда 	
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Найдено несколько статей %1. Двойным кликом выберите одну из списка.'"), 
					СтрокаТаблицы.НаименованиеСтатьиДДС);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			КонецЕсли;
			Если СтрокаТаблицы.СтатусНаправленияДеятельности = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусДубль() Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Найдено несколько направлений деятельности %1. Двойным кликом выберите одну из списка.'"), 
					СтрокаТаблицы.НаименованиеНаправленияДеятельности);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла;
		
	ПроверитьНаДублирующиеЭлементы("Финансирование", Отказ); 
	ПроверитьНаДублирующиеЭлементы("Расход", Отказ);

КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.СтатьиДвиженияДенежныхСредств.Форма.ФормаВыбора" Тогда
		
		ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		МодификацияДерево = Истина;
		ТекущиеДанные.СтатьяДДС = ВыбранноеЗначение;
		ТекущиеДанные.СтатусСтатьиДДС = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНайденный(); 
		ТекущиеДанные.ЕстьДубли = Ложь;
		ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
		Если ТекущиеДанные.Раздел = "Расход" Тогда
			СтрокаНаправленияДеятельности = ТекущиеДанные.ПолучитьРодителя(); 
			Если СтрокаНаправленияДеятельности.СтатусНаправленияДеятельности <> ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусДубль() Тогда
				СтрокаНаправленияДеятельности.ЕстьДубли = Ложь; 
				ТекущиеДанные.НайденнаяСтрока = Истина;
			КонецЕсли;
		Иначе 
			ТекущиеДанные.НайденнаяСтрока = Истина;
		КонецЕсли;
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.НаправленияДеятельности.Форма.ФормаВыбора" Тогда
		ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		МодификацияДерево = Истина;
		ТекущиеДанные.НаправлениеДеятельности = ВыбранноеЗначение;
		ТекущиеДанные.СтатусНаправленияДеятельности = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНайденный(); 
		Если Не ТекущиеДанные.СтатусСтатьиДДС = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусДубль() Тогда
			ТекущиеДанные.ЕстьДубли = Ложь;	
		КонецЕсли;      
		ТекущиеДанные.НайденнаяСтрока = Истина; 
		ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.ПриложитьФайл;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти  

#Область ОбработчикиСобытийТабличногоДокумента
&НаКлиенте
Процедура ДанныеФайлаВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Область.Верх = 1 И Область.Лево <= ДанныеФайла.ШиринаТаблицы Тогда
		
		ДополнительныеПараметры = Новый Структура("ТекущаяОбласть", Область);
		ОписаниеОповещения = Новый ОписаниеОповещения("ДанныеФайлаВыборЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОписаниеКолонок", ОписаниеКолонокВоВременномХранилище());
		ОткрытьФорму("ОбщаяФорма.ВыборКолонокПриЗагрузкеИзФайла", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеФайлаВыборЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Или РезультатЗакрытия = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ТекстНезаполненногоЗаголовка = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.ТекстЗаголовкаНесопоставленнойКолонки();
	Для НомерКолонки = 1 По ДанныеФайла.ШиринаТаблицы Цикл
		
		Область = ДанныеФайла.Область(1, НомерКолонки);
		Если Область.ПараметрРасшифровки = РезультатЗакрытия.Идентификатор Тогда
			Область.Текст = ТекстНезаполненногоЗаголовка;
			Область.ПараметрРасшифровки = "";
			Область.ЦветТекста = ОбщегоНазначенияКлиентПовтИсп.ЦветСтиля("НезаполненныйРеквизит");
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнительныеПараметры.ТекущаяОбласть.Текст      = РезультатЗакрытия.Представление;
	ДополнительныеПараметры.ТекущаяОбласть.ЦветТекста = ОбщегоНазначенияКлиентПовтИсп.ЦветСтиля("ЦветГиперссылки");
	ДополнительныеПараметры.ТекущаяОбласть.ПараметрРасшифровки = РезультатЗакрытия.Идентификатор;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийДеревоБюджета
&НаКлиенте
Процедура ДеревоБюджетаПриИзменении(Элемент)
	
	МодификацияДерево = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаСтатьяДДСПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.СтатьяДДС) Тогда		
		ТекущиеДанные.СтатусСтатьиДДС = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНайденный();
		ТекущиеДанные.ЕстьНовыеСтроки = Ложь;	
		ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.Реквизит;
		Если ТекущиеДанные.Раздел = "Расход" Тогда
			СтрокаНаправленияДеятельности = ТекущиеДанные.ПолучитьРодителя(); 
			Если СтрокаНаправленияДеятельности.СтатусНаправленияДеятельности <> ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНовый() Тогда
				СтрокаНаправленияДеятельности.ЕстьНовыеСтроки = Ложь; 
				ТекущиеДанные.НайденнаяСтрока = Истина;
			КонецЕсли;
		Иначе 
			ТекущиеДанные.НайденнаяСтрока = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаСтатьяДДСАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	
	Если ТекущиеДанные.СтатусСтатьиДДС = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНовый() Тогда	
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений; 
		ТекстПодбора = СтрШаблон(НСтр("ru = 'Создать: %1'"), ТекущиеДанные.НаименованиеСтатьиДДС);
		ДанныеВыбора.Добавить(ТекстПодбора);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаСтатьяДДСНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	
	Если ТекущиеДанные.Раздел = "Финансирование" Тогда
		ОтборВидСтатьи = Новый ПараметрВыбора("Отбор.ВидСтатьиДДС", ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.Доход"));
	Иначе
		ОтборВидСтатьи = Новый ПараметрВыбора("Отбор.ВидСтатьиДДС", ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.Расход"));
	КонецЕсли;  
	
	МассивОтборов = Новый Массив();  
	ОтборПометкаНаУдаление = Новый ПараметрВыбора("Отбор.ПометкаУдаления", Ложь);
	МассивОтборов.Добавить(ОтборПометкаНаУдаление);
	МассивОтборов.Добавить(ОтборВидСтатьи);
	ПараметрыОтбора = Новый ФиксированныйМассив(МассивОтборов);
	Элемент.ПараметрыВыбора = ПараметрыОтбора;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаСтатьяДДСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") И СтрНайти(ВыбранноеЗначение, НСтр("ru = 'Создать:'")) > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Наименование", ТекущиеДанные.НаименованиеСтатьиДДС); 
		
		Если ТекущиеДанные.Раздел = "Финансирование" Тогда
			ДанныеЗаполнения.Вставить("ВидСтатьиДДС", ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.Доход"));
		Иначе
			ДанныеЗаполнения.Вставить("ВидСтатьиДДС", ПредопределенноеЗначение("Перечисление.ВидСтатьиДвиженияДенег.Расход"));
		КонецЕсли;
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ТекстЗаполнения", ТекущиеДанные.НаименованиеСтатьиДДС);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
		
		ОткрытьФорму("Справочник.СтатьиДвиженияДенежныхСредств.ФормаОбъекта", ПараметрыФормы, Элемент);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДеревоБюджетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	
	Если ТекущиеДанные.СтатусСтатьиДДС = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусДубль()
		И (Элемент.ТекущийЭлемент.Имя = "ДеревоБюджетаСтатьяДДС" ИЛИ Элемент.ТекущийЭлемент.Имя = "ДеревоБюджетаКартинкаСтатьиДДС") Тогда	
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОтборДублей", ТекущиеДанные.СписокСтатейДДС);
		ОткрытьФорму("Справочник.СтатьиДвиженияДенежныхСредств.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект); 
	ИначеЕсли ТекущиеДанные.СтатусНаправленияДеятельности = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусДубль()
		И (Элемент.ТекущийЭлемент.Имя = "ДеревоБюджетаНаправлениеДеятельности" 
		ИЛИ Элемент.ТекущийЭлемент.Имя = "ДеревоБюджетаКартинкаНаправлениеДеятельности") Тогда	
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ОтборДублей", ТекущиеДанные.СписокНаправленийДеятельности); 
		ОткрытьФорму("Справочник.НаправленияДеятельности.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаНаправлениеДеятельностиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.НаправлениеДеятельности) Тогда		
		ТекущиеДанные.СтатусНаправленияДеятельности = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНайденный();
		ТекущиеДанные.НайденнаяСтрока = Истина;
		Если Не ТекущиеДанные.СтатусСтатьиДДС = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНовый() Тогда
			ТекущиеДанные.ЕстьНовыеСтроки = Ложь;	
		КонецЕсли;   
		
		ТекущиеДанные.КартинкаСтроки = БиблиотекаКартинок.ПриложитьФайл;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаНаправлениеДеятельностиАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	
	Если ТекущиеДанные.СтатусНаправленияДеятельности = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНовый() Тогда	
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений; 
		ТекстПодбора = СтрШаблон(НСтр("ru = 'Создать: %1'"), ТекущиеДанные.НаименованиеНаправленияДеятельности);
		ДанныеВыбора.Добавить(ТекстПодбора);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоБюджетаНаправлениеДеятельностиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") И СтрНайти(ВыбранноеЗначение, НСтр("ru = 'Создать:'")) > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("Наименование", ТекущиеДанные.НаименованиеНаправленияДеятельности);  
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ТекстЗаполнения", ТекущиеДанные.НаименованиеНаправленияДеятельности);
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ДанныеЗаполнения);
		
		ОткрытьФорму("Справочник.НаправленияДеятельности.ФормаОбъекта", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ДеревоБюджетаСуммаПриИзменении(Элемент)
	
	РассчитатьИтоги(Элемент);
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	Верх = ДанныеФайла.ТекущаяОбласть.Верх;
	Низ  = ДанныеФайла.ТекущаяОбласть.Низ;
	Лево = ДанныеФайла.ТекущаяОбласть.Лево;
	
	Если Верх = 1 И Низ = 1 Тогда
		
		Возврат; 		
	КонецЕсли;
	
	УдалитьСтрокиНаСервере(Верх, Низ);
	Элементы.ДанныеФайла.ТекущаяОбласть = ДанныеФайла.Область(Верх, Лево);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКолонку(Команда)
	
	Лево  = ДанныеФайла.ТекущаяОбласть.Лево;
	Право = ДанныеФайла.ТекущаяОбласть.Право;
	Верх  = ДанныеФайла.ТекущаяОбласть.Верх;
	
	УдалитьКолонкиНаСервере(Лево, Право);
	Элементы.ДанныеФайла.ТекущаяОбласть = ДанныеФайла.Область(Верх, Лево);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЛишнее(Команда)
	
	ЗаголовкиЗаполнены = ЗагрузкаДанныхИзВнешнихФайловКлиент.ЗаполненыВсеЗаголовкиКолонок(ДанныеФайла, "ДанныеФайла", ОписаниеКолонок);
	
	Если ЗаголовкиЗаполнены Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьЛишнееПослеЗакрытияВопроса", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Найти и удалить строки и колонки, не содержащие информацию для загрузки?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе 
		ТекстСообщения = НСтр("ru = 'Укажите названия колонок для сопоставления данных'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ОчиститьСообщения();
	
	ЗаголовкиЗаполнены = ЗагрузкаДанныхИзВнешнихФайловКлиент.ЗаполненыВсеЗаголовкиКолонок(ДанныеФайла, "ДанныеФайла", ОписаниеКолонок);
	
	Если Не ЗаголовкиЗаполнены Тогда
		Возврат;
	КонецЕсли;
	
	ОтборТаблицы = 0;
	
	ДлительнаяОперация = ПодготовитьТаблицуБюджетаСервер();
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
	Иначе
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		Обработчик = Новый ОписаниеОповещения("ПодготовитьТаблицуДанныхДляЗагрузкиЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Если ТабличнаяЧастьИзменена Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВопросаОПереходеНаПервыйШаг", ЭтотОбъект);
		ТекстВопроса = НСтр(
		"ru = 'Все изменения, произведенные вами в таблице, будут потеряны.
		|
		|Вернуться на предыдущий шаг?'");
		
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		ТабличнаяЧастьИзменена = Ложь;
		
	Иначе
		
		ИзменитьШаг("Шаг1");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	ДлительнаяОперация = ЗагрузитьНаСервере();
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат; 
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
	Иначе
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		Обработчик = Новый ОписаниеОповещения("ЗагрузкаДанныхИзФайлаЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область УправлениеФормой 
&НаСервере
Процедура ИзменитьШаг(ТекущийШаг)
	
	Элементы.ГруппаОжидание.Видимость = Ложь;
	Элементы.ГруппаШаг1.Видимость = (ТекущийШаг = "Шаг1");
	Элементы.ГруппаШаг2.Видимость = (ТекущийШаг = "Шаг2");
	Элементы.Далее.КнопкаПоУмолчанию = (ТекущийШаг = "Шаг1");
	Элементы.Загрузить.КнопкаПоУмолчанию = (ТекущийШаг = "Шаг2");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Серый текст для новой статьи ддс или направления деятельности	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаНаправлениеДеятельности");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.НаправлениеДеятельности", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.СтатусНаправленияДеятельности", ВидСравненияКомпоновкиДанных.Равно, ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНовый());
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСерый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("ДеревоБюджета.ПредставлениеНаправленияДеятельности"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаСтатьяДДС");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.СтатьяДДС", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.СтатусСтатьиДДС", ВидСравненияКомпоновкиДанных.Равно, ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНовый());
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСерый);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("ДеревоБюджета.ПредставлениеСтатьиДДС"));
	
	// Красный текст для дублей
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаСтатьяДДС");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.СтатьяДДС", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.СтатусСтатьиДДС", ВидСравненияКомпоновкиДанных.Равно, ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусДубль());
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Кирпичный);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("ДеревоБюджета.ПредставлениеСтатьиДДС"));   
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаНаправлениеДеятельности");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.НаправлениеДеятельности", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.СтатусНаправленияДеятельности", ВидСравненияКомпоновкиДанных.Равно, ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусДубль());
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Кирпичный);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", Новый ПолеКомпоновкиДанных("ДеревоБюджета.ПредставлениеНаправленияДеятельности"));
	
	// Условное оформление для дерева
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаРаздел");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоРаздел", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь); 
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджета");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоРаздел", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Формат", "ЧЦ=15; ЧДЦ=2; ЧН=0,00");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтРазделБюджета);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаКартинкаСтрокиНаправленияДеятельности");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаНаправлениеДеятельности");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоНаправлениеДеятельности", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);  
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджета");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоНаправлениеДеятельности", ВидСравненияКомпоновкиДанных.Равно, Истина); 
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Шрифт", ШрифтыСтиля.ШрифтНаправлениеДеятельностиБюджета);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаКартинкаСтрокиНаправленияДеятельности");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаНаправлениеДеятельности");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоНаправлениеДеятельности", ВидСравненияКомпоновкиДанных.Равно, Истина);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаКартинкаСтрокиСтатьяДДС");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджетаСтатьяДДС");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЭтоСтатьяДДС", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь); 
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджета");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборТаблицы", ВидСравненияКомпоновкиДанных.Равно, 1);  
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.НайденнаяСтрока", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджета");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборТаблицы", ВидСравненияКомпоновкиДанных.Равно, 2);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЕстьНовыеСтроки", ВидСравненияКомпоновкиДанных.Равно, Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДеревоБюджета");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтборТаблицы", ВидСравненияКомпоновкиДанных.Равно, 3);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ДеревоБюджета.ЕстьДубли", ВидСравненияКомпоновкиДанных.Равно, Ложь); 
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры  
#КонецОбласти  

#Область ПодготовкаТабличногоДокумента
&НаКлиенте
Процедура Подключаемый_ПодготовитьТабличныйДокумент()
	
	ДлительнаяОперация = ДлительнаяОперация(АдресФайла, УникальныйИдентификатор, ОписаниеКолонок, ДанныеФайла);
	
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
	Иначе
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		Обработчик = Новый ОписаниеОповещения("ПодготовитьТабличныйДокументЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДлительнаяОперация(Знач АдресФайла, Знач ИдентификаторФормы, Знач ОписаниеКолонок, Знач ДанныеФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	ХранилищеДанных = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	УдалитьИзВременногоХранилища(АдресФайла);
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("ТабличныйДокумент", ДанныеФайла); 
	ПараметрыЗадания.Вставить("ХранилищеДанныхФайла", ХранилищеДанных);
	ПараметрыЗадания.Вставить("ОписаниеКолонок", ОписаниеКолонок.Выгрузить());
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Подготовка табличного документа к загрузке бюджета.'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ЗагрузкаБюджетаИзФайла.ОбработатьДанныеИзФайла",
		ПараметрыЗадания, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПодготовитьТабличныйДокументЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		ЗаполнитьТабличныйДокументСервер(ДлительнаяОперация.АдресРезультата);
	ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
		ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
	КонецЕсли; 
	
	Если ТипЗнч(ОписаниеКолонок) <> Тип("ДанныеФормыКоллекция") Тогда
		ЗаголовкиНеЗаполнены = Ложь;
	КонецЕсли;
	
	ОбязательныеКолонки = ЗагрузкаДанныхИзВнешнихФайловКлиент.ОбязательныеКолонки(ОписаниеКолонок);
	
	ЕстьНезаполненныйЗаголовок = Ложь;
	ШиринаТаблицы = ДанныеФайла.ШиринаТаблицы;
	ТекстНезаполненныйЗаголовок = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.ТекстЗаголовкаНесопоставленнойКолонки();
	
	Для НомерКолонки = 1 По ШиринаТаблицы Цикл
		
		Ячейка = ДанныеФайла.Область("R1C" + НомерКолонки);
		
		Если Ячейка.Текст = ТекстНезаполненныйЗаголовок Тогда
			ЕстьНезаполненныйЗаголовок = Истина;
			Продолжить;
		КонецЕсли;
		
		ОбязательнаяКолонка = ОбязательныеКолонки.Найти(Ячейка.ПараметрРасшифровки);
		Если ОбязательнаяКолонка <> Неопределено Тогда
			ОбязательныеКолонки.Удалить(ОбязательнаяКолонка);
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаголовкиНеЗаполнены = ЕстьНезаполненныйЗаголовок Или ОбязательныеКолонки.Количество() > 0;
	
	Если ЗаголовкиНеЗаполнены Тогда
		ПоказыватьВторойШагОбязательно = Истина;
		ИзменитьШаг("Шаг1");
	Иначе 
		ОтборТаблицы = 0;
		
		ДлительнаяОперация = ПодготовитьТаблицуБюджетаСервер();
		Если ДлительнаяОперация.Статус = "Ошибка" Тогда
			ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
		Иначе
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			Обработчик = Новый ОписаниеОповещения("ПодготовитьТаблицуДанныхДляЗагрузкиЗавершение", ЭтотОбъект);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныйДокументСервер(АдресРезультата)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресРезультата);
	ДанныеФайла = ЗагруженныеДанные.ДанныеФайла.Получить(); 
	УдалитьИзВременногоХранилища(АдресРезультата);
	
КонецПроцедуры
#КонецОбласти

#Область УдалениеЛишнихДанных
&НаСервере
Процедура УдалитьСтрокиНаСервере(Верх, Низ)
	
	Если Верх = 1 Тогда
		Верх = 2;
	КонецЕсли;
	
	Область = ДанныеФайла.Область(Верх, , Низ);
	ДанныеФайла.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоВертикали);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьКолонкиНаСервере(Лево, Право)
	
	Область = ДанныеФайла.Область(, Лево, , Право);
	ДанныеФайла.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЛишнееПослеЗакрытияВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ДанныеФайла, "Ожидание");
	
	ОчиститьСообщения();
	
	ДлительнаяОперация = УдалитьЛишнееСервер();
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
	Иначе
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		Обработчик = Новый ОписаниеОповещения("УдалитьЛишнееЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Обработчик, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УдалитьЛишнееСервер()
	
	ПараметрыЗадания = Новый Структура;
	ХранилищеДанных = Новый ХранилищеЗначения(ДанныеФайла);
	ПараметрыЗадания.Вставить("ХранилищеДанных", ХранилищеДанных);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Удаление незначимых строк табличного документа.'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
	"Обработки.ЗагрузкаБюджетаИзФайла.УдалитьВсеНенужныеСтрокиТаблицы",
	ПараметрыЗадания, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура УдалитьЛишнееЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		НайденыНенужныеСтроки = Ложь;
		ОбработатьРезультатУдаленияЛишнихСтрок(ДлительнаяОперация.АдресРезультата, НайденыНенужныеСтроки);
		Если НЕ НайденыНенужныеСтроки Тогда	
			ТекстСообщения = НСтр("ru = 'Строк и колонок, не содержащих информацию для загрузки, не обнаружено.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);		
		Иначе	
			ТекстСообщения = НСтр("ru = 'Удаление завершено.'");
			ТекстПояснения = НСтр("ru = 'Удаление незначимых данных завершено.'");
			ПоказатьОповещениеПользователя(ТекстСообщения, , ТекстПояснения);		
		КонецЕсли;
	ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
		ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатУдаленияЛишнихСтрок(АдресРезультата, НайденыНенужныеСтроки)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	НайденыНенужныеСтроки = Результат.НайденыНенужныеСтроки;
	Если НайденыНенужныеСтроки Тогда
		ДанныеФайла = Результат.ХранилищеДанных.Получить();
	КонецЕсли;
	
	ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.ДанныеФайла, "НеИспользовать");
	
КонецПроцедуры  
#КонецОбласти 

#Область ПодготовкаТаблицыДанныхДляЗагрузки
&НаСервере
Функция ПодготовитьТаблицуБюджетаСервер()
	
	ПараметрыЗадания = Новый Структура;
	ХранилищеДанных = Новый ХранилищеЗначения(ДанныеФайла);
	ПараметрыЗадания.Вставить("ХранилищеДанных", ХранилищеДанных); 
	ПараметрыЗадания.Вставить("Детализация", Детализация);
		
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Подготовка таблицы при загрузке бюджета.'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ЗагрузкаБюджетаИзФайла.ПолучитьТаблицуДанныхБюджета",
	ПараметрыЗадания, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ПодготовитьТаблицуДанныхДляЗагрузкиЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		ЗаполнитьТаблицуБюджета(ДлительнаяОперация.АдресРезультата);
	ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
		ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Если ЕстьОшибкиПриЗагрузкиТаблицы Тогда
		ИзменитьШаг("Шаг1");
		Возврат;
	КонецЕсли; 
	
	Если Не ПоказыватьВторойШагОбязательно Тогда
		ДлительнаяОперация = ЗагрузитьНаСервере();
		Если ДлительнаяОперация = Неопределено Тогда
			Возврат; 
		КонецЕсли;
		ПоказатьОповещениеПользователя(НСтр("ru = 'Загрузка бюджета успешно произведена.'"), , , БиблиотекаКартинок.ВыполненоУспешно);
		Если НужнаКорректировка Тогда 
			ДокументКорректировки = ДокументКорректировкиПослеЗагрузки(ДлительнаяОперация.АдресРезультата);
			ПараметрыФормы = Новый Структура("ДокументСсылка", ДокументКорректировки);
			ОткрытьФорму("Обработка.КорректировкаБюджета.Форма.Форма", ПараметрыФормы);
			Оповестить("Запись_КорректировкаБюджета", , ДокументКорректировки);
		Иначе 
			Оповестить("Запись_КорректировкаБюджета", , ДокументБюджета);	
		КонецЕсли; 
		Закрыть();  	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуБюджета(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЕстьОшибкиПриЗагрузкиТаблицы = Ложь;
	Если Результат.Свойство("ТекстОшибки") Тогда 
		ЕстьОшибкиПриЗагрузкиТаблицы = Истина;   
		ПоказыватьВторойШагОбязательно = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ТекстОшибки);
		Возврат;	
	КонецЕсли;
	
	Объект.Бюджет.Загрузить(Результат.Бюджет);
	НовыеРеквизитыФормы = Новый Массив;
	ДатаДетализации = НачалоГода(ТекущаяДатаСеанса());
	Для НомерПериода = 1 По КоличествоПериодов Цикл    
		Если Элементы.Найти(СтрШаблон("ДеревоБюджета%1%2", ИмяПериода, НомерПериода)) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяПериода = "СуммаКвартал" Тогда
			ЗаголовокРеквизита = СтрШаблон(НСтр("ru = '%1 квартал'"), НомерПериода);
		Иначе
			ЗаголовокРеквизита = СтрШаблон(НСтр("ru = '%1'"), Формат(ДатаДетализации, "ДФ=MMMM"));
			ДатаДетализации = ДобавитьМесяц(ДатаДетализации, 1);
		КонецЕсли;
		
		НовыйРеквизитФормы = Новый РеквизитФормы(
		СтрШаблон("%1%2", ИмяПериода, НомерПериода),
		ОбщегоНазначения.ОписаниеТипаЧисло(15, 2),
		"ДеревоБюджета",
		ЗаголовокРеквизита,
		Истина);
		НовыеРеквизитыФормы.Добавить(НовыйРеквизитФормы);		
	КонецЦикла;
	
	ИзменитьРеквизиты(НовыеРеквизитыФормы);
	ИзменитьКолонкиДетализацииНаФорме();
	ПостроитьДеревоБюджета();
	ИзменитьШаг("Шаг2");
		
КонецПроцедуры

&НаСервере
Процедура ИзменитьКолонкиДетализацииНаФорме()
	
	ТекущийЭлементДляВставки = Элементы.Найти("ДеревоБюджетаСуммаГод");
	ЭлементРодитель          = Элементы.Найти("ДеревоБюджета");
	ТипНовогоЭлемента        = Тип("ПолеФормы");
	
	ДатаДетализации = НачалоГода(ТекущаяДатаСеанса());
	
	Для Счет = 1 По КоличествоПериодов Цикл 
		ИмяЭлемента = СтрШаблон("ДеревоБюджета%1%2", ИмяПериода, Счет);
		Если Элементы.Найти(ИмяЭлемента) <> Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ИмяПериода = "СуммаКвартал" Тогда
			ЗаголовокРеквизита = СтрШаблон(НСтр("ru = '%1 квартал'"), Счет);
		Иначе
			ЗаголовокРеквизита = СтрШаблон(НСтр("ru = '%1'"), Формат(ДатаДетализации, "ДФ=MMMM"));
			ДатаДетализации = ДобавитьМесяц(ДатаДетализации, 1);
		КонецЕсли;
		
		ЭлементДляВставки = Элементы.Вставить(ИмяЭлемента, ТипНовогоЭлемента, ЭлементРодитель, ТекущийЭлементДляВставки);
		ЭлементДляВставки.ПутьКДанным = СтрШаблон("ДеревоБюджета.%1%2", ИмяПериода, Счет);
		ЭлементДляВставки.Заголовок = ЗаголовокРеквизита;
		ЭлементДляВставки.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДляВставки.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Право;
		ЭлементДляВставки.Ширина = 10;
		ЭлементДляВставки.ВыделятьОтрицательные = Истина; 
		ЭлементДляВставки.УстановитьДействие("ПриИзменении", "ДеревоБюджетаСуммаПриИзменении");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДеревоБюджета()
	
	ДеревоБюджета.ПолучитьЭлементы().Очистить();
	
	РазделДоходы = НовыйРаздел(ДеревоБюджета, НСтр("ru = 'Финансирование'"));
	ИдентификаторДоходы = РазделДоходы.ПолучитьИдентификатор();
	ВывестиСтрокиДохода(РазделДоходы);
	
	РазделаРасходы = НовыйРаздел(ДеревоБюджета, НСтр("ru = 'Расход'"));
	ИдентификаторРасходы = РазделаРасходы.ПолучитьИдентификатор();
	ВывестиСтрокаРасхода(РазделаРасходы);     
	
КонецПроцедуры

&НаСервере
Функция НовыйРаздел(Дерево, ИмяРаздела)
	
	СтрокаРаздела = Дерево.ПолучитьЭлементы().Добавить();
	СтрокаРаздела.Раздел = ИмяРаздела;
	СтрокаРаздела.ЭтоРаздел = Истина;  
	СтрокаРаздела.ЕстьДубли = Истина; 
	СтрокаРаздела.НайденнаяСтрока = Истина; 
	СтрокаРаздела.ЕстьНовыеСтроки = Истина;
	Отбор = Новый Структура("Раздел", ИмяРаздела); 
	ТаблицаРаздела = Объект.Бюджет.Выгрузить(Отбор);
	СтрокаРаздела.СуммаГод = ТаблицаРаздела.Итог("СуммаГод");
	
	Для НомерПериода = 1 По КоличествоПериодов Цикл
		ЭлементСтроки = СтрШаблон("%1%2", ИмяПериода, НомерПериода);
		СтрокаРаздела[ЭлементСтроки] = ТаблицаРаздела.Итог(ЭлементСтроки);
	КонецЦикла;
		
	Возврат СтрокаРаздела;
	
КонецФункции  

&НаСервере
Процедура ВывестиСтрокиДохода(РазделДоходы)
	
	Для Каждого СтрокаБюджета Из Объект.Бюджет Цикл
		Если Не  СтрокаБюджета.Раздел = "Финансирование" Тогда 
			Продолжить;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаБюджета.ГруппаСтатей) Тогда
			ПараметрыПоиска = Новый Структура("СтатьяДДС, НаименованиеСтатьиДДС", 
				СтрокаБюджета.ГруппаСтатей, СтрокаБюджета.НаименованиеГруппыСтатей);
			НайденныеСтроки = РеквизитФормыВЗначение("ДеревоБюджета").Строки[0].Строки.НайтиСтроки(ПараметрыПоиска);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			НоваяСтрока = РазделДоходы.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаБюджета);
			НоваяСтрока.СтатьяДДС = СтрокаБюджета.ГруппаСтатей;
			НоваяСтрока.НаименованиеСтатьиДДС = СтрокаБюджета.НаименованиеГруппыСтатей;
			НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.Папка;
			НоваяСтрока.ЭтоГруппаСтатей = Истина; 
			НоваяСтрока.ЭтоСтатьяДДС = Истина;
			
			НоваяСтрока.СуммаГод = 0;
			Для НомерПериода = 1 По КоличествоПериодов Цикл  
				ЭлементСтроки = СтрШаблон("%1%2", ИмяПериода, НомерПериода);
				НоваяСтрока[ЭлементСтроки] = 0;
			КонецЦикла;
			
			Отбор = Новый Структура("ГруппаСтатей, НаименованиеГруппыСтатей, Раздел", 
				СтрокаБюджета.ГруппаСтатей, СтрокаБюджета.НаименованиеГруппыСтатей, "Финансирование");
			ВывестиСтрокиДоходовСИерархией(НоваяСтрока, Отбор);
		Иначе
			НоваяСтрока = РазделДоходы.ПолучитьЭлементы().Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаБюджета);  
			
			НоваяСтрока.ЭтоСтатьяДДС = Истина;
			ЭтоСтатья = Истина;  
			ВывестиКартинкуКСтроке(НоваяСтрока, СтрокаБюджета.СтатусСтатьиДДС, ЭтоСтатья);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ВывестиСтрокиДоходовСИерархией(СтрокаГруппаСтатей, Отбор)
	
	ТаблицаРасходов = Объект.Бюджет.Выгрузить(Отбор); 
	Для Каждого СтрокаДоходов Из ТаблицаРасходов Цикл
		НоваяСтрока = СтрокаГруппаСтатей.ПолучитьЭлементы().Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДоходов); 
		НоваяСтрока.ЭтоСтатьяДДС = Истина; 
		
		// Проверяем статусы для верхнего уровня таблицы
		// Возвводим флаг, если хотя бы у одной подчиненной строки есть новая строка  
		Если СтрокаДоходов.ЕстьНовыеСтроки Тогда 
			СтрокаГруппаСтатей.ЕстьНовыеСтроки = Истина;
		КонецЕсли;  
			
		// Проверяем статусы для верхнего уровня таблицы
		// Возвводим флаг, если хотя бы у одной подчиненной строки есть дубли
		Если СтрокаДоходов.ЕстьДубли Тогда 
			СтрокаГруппаСтатей.ЕстьДубли = Истина;
		КонецЕсли; 
		
		ЭтоСтатья = Истина; 
		ВывестиКартинкуКСтроке(НоваяСтрока, СтрокаДоходов.СтатусСтатьиДДС, ЭтоСтатья);
		
		Если НоваяСтрока.СтатусСтатьиДДС <> ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНайденный() Тогда
			НоваяСтрока.НайденнаяСтрока = Ложь;
		КонецЕсли;
		
		Если НоваяСтрока.СтатусСтатьиДДС <> ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНовый() Тогда
			НоваяСтрока.ЕстьНовыеСтроки = Ложь;
		КонецЕсли; 
		
		Если НоваяСтрока.СтатусСтатьиДДС <> ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусДубль() Тогда
			НоваяСтрока.ЕстьДубли = Ложь;
		КонецЕсли;
		
		Для НомерПериода = 1 По КоличествоПериодов Цикл  
			ЭлементСтроки = СтрШаблон("%1%2", ИмяПериода, НомерПериода);
			СтрокаГруппаСтатей[ЭлементСтроки] = СтрокаГруппаСтатей[ЭлементСтроки] + СтрокаДоходов[ЭлементСтроки];
		КонецЦикла;
			
		СтрокаГруппаСтатей.СуммаГод = СтрокаГруппаСтатей.СуммаГод + СтрокаДоходов.СуммаГод;
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Процедура ВывестиСтрокаРасхода(РазделаРасходы)
	
	Для Каждого СтрокаБюджета Из Объект.Бюджет Цикл
		Если Не  СтрокаБюджета.Раздел = "Расход" Тогда 
			Продолжить;	
		КонецЕсли;
		
		ПараметрыПоиска = Новый Структура("НаправлениеДеятельности, НаименованиеНаправленияДеятельности", 
		СтрокаБюджета.НаправлениеДеятельности, СтрокаБюджета.НаименованиеНаправленияДеятельности);
		НайденныеСтроки = РеквизитФормыВЗначение("ДеревоБюджета").Строки[1].Строки.НайтиСтроки(ПараметрыПоиска);
		
		Если НайденныеСтроки.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = РазделаРасходы.ПолучитьЭлементы().Добавить(); 
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаБюджета);  
		// Обнуляем числовые данные для направления деятельности 
		// Они вычисляются в ВывестиСтрокиРасходовПоНаправлениюДеятельности() 
		НоваяСтрока.СуммаГод = 0;
		Для НомерПериода = 1 По КоличествоПериодов Цикл  
			ЭлементСтроки = СтрШаблон("%1%2", ИмяПериода, НомерПериода);
			НоваяСтрока[ЭлементСтроки] = 0;
		КонецЦикла;

		НоваяСтрока.ЭтоНаправлениеДеятельности = Истина;  
		
		ЭтоСтатья = Ложь; 
		ВывестиКартинкуКСтроке(НоваяСтрока, СтрокаБюджета.СтатусНаправленияДеятельности, ЭтоСтатья);

		Если СтрокаБюджета.СтатусНаправленияДеятельности = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНайденный() Тогда
			НоваяСтрока.НайденнаяСтрока = Истина;
		КонецЕсли;
		
		Отбор = Новый Структура("НаправлениеДеятельности, НаименованиеНаправленияДеятельности, Раздел", 
			СтрокаБюджета.НаправлениеДеятельности, СтрокаБюджета.НаименованиеНаправленияДеятельности, "Расход");
		ВывестиСтрокиРасходовПоНаправлениюДеятельности(НоваяСтрока, Отбор);
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ВывестиСтрокиРасходовПоНаправлениюДеятельности(СтрокаНаправленияДеятельности, Отбор)
	
	ТаблицаРасходов = Объект.Бюджет.Выгрузить(Отбор); 
	Для Каждого СтрокаРасходов Из ТаблицаРасходов Цикл
		
		Если ЗначениеЗаполнено(СтрокаРасходов.ГруппаСтатей) 
			И СтрокаНаправленияДеятельности.ЭтоНаправлениеДеятельности Тогда
			ПараметрыПоиска = Новый Структура("НаправлениеДеятельности, НаименованиеНаправленияДеятельности, СтатьяДДС, НаименованиеСтатьиДДС", 
				СтрокаРасходов.НаправлениеДеятельности, СтрокаРасходов.НаименованиеНаправленияДеятельности,
				СтрокаРасходов.ГруппаСтатей, СтрокаРасходов.НаименованиеГруппыСтатей);
			НайденныеСтроки = РеквизитФормыВЗначение("ДеревоБюджета").Строки[1].Строки[СтрокаРасходов.НомерНаправленияДеятельности - 1].Строки.НайтиСтроки(
				ПараметрыПоиска);
				
			Если НайденныеСтроки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = СтрокаНаправленияДеятельности.ПолучитьЭлементы().Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасходов); 
			НоваяСтрока.ЭтоСтатьяДДС = Истина;
			НоваяСтрока.СтатьяДДС = СтрокаРасходов.ГруппаСтатей;  
			НоваяСтрока.НаименованиеСтатьиДДС = СтрокаРасходов.НаименованиеГруппыСтатей;
			НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.Папка; 
			НоваяСтрока.ЭтоГруппаСтатей = Истина;  
			
			Для НомерПериода = 1 По КоличествоПериодов Цикл  
				ЭлементСтроки = СтрШаблон("%1%2", ИмяПериода, НомерПериода);
				СтрокаНаправленияДеятельности[ЭлементСтроки] = СтрокаНаправленияДеятельности[ЭлементСтроки] + СтрокаРасходов[ЭлементСтроки];
				НоваяСтрока[ЭлементСтроки] = 0; 
			КонецЦикла;
			
			СтрокаНаправленияДеятельности.СуммаГод = СтрокаНаправленияДеятельности.СуммаГод + СтрокаРасходов.СуммаГод;
			
			НоваяСтрока.СуммаГод = 0;
		Иначе 
			НоваяСтрока = СтрокаНаправленияДеятельности.ПолучитьЭлементы().Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРасходов); 
			НоваяСтрока.ЭтоСтатьяДДС = Истина;
		КонецЕсли; 
		
		Если НоваяСтрока.ЭтоГруппаСтатей Тогда	
			Отбор = Новый Структура("НаправлениеДеятельности, НаименованиеНаправленияДеятельности, ГруппаСтатей, НаименованиеГруппыСтатей, Раздел", 
				СтрокаРасходов.НаправлениеДеятельности, СтрокаРасходов.НаименованиеНаправленияДеятельности,
				СтрокаРасходов.ГруппаСтатей, СтрокаРасходов.НаименованиеГруппыСтатей, "Расход");
            ВывестиСтрокиРасходовПоНаправлениюДеятельности(НоваяСтрока, Отбор);
		Иначе
			ЭтоСтатья = Истина; 
			ВывестиКартинкуКСтроке(НоваяСтрока, СтрокаРасходов.СтатусСтатьиДДС, ЭтоСтатья);
		КонецЕсли;
			
		// Проверяем статусы для верхнего уровня таблицы
		// Возвводим флаг, если хотя бы у одной подчиненной строки есть новая строка  
		Если СтрокаРасходов.ЕстьНовыеСтроки Тогда 
			СтрокаНаправленияДеятельности.ЕстьНовыеСтроки = Истина;
		КонецЕсли;  
			
		// Проверяем статусы для верхнего уровня таблицы
		// Возвводим флаг, если хотя бы у одной подчиненной строки есть дубли
		Если СтрокаРасходов.ЕстьДубли Тогда 
			СтрокаНаправленияДеятельности.ЕстьДубли = Истина;
		КонецЕсли; 
		
		Если НоваяСтрока.СтатусСтатьиДДС <> ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНайденный() Тогда
			НоваяСтрока.НайденнаяСтрока = Ложь;
		КонецЕсли;
		
		Если НоваяСтрока.СтатусСтатьиДДС <> ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНовый() Тогда
			НоваяСтрока.ЕстьНовыеСтроки = Ложь;
		КонецЕсли; 
		
		Если НоваяСтрока.СтатусСтатьиДДС <> ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусДубль() Тогда
			НоваяСтрока.ЕстьДубли = Ложь;
		КонецЕсли;
		
		Для НомерПериода = 1 По КоличествоПериодов Цикл  
			ЭлементСтроки = СтрШаблон("%1%2", ИмяПериода, НомерПериода);
			СтрокаНаправленияДеятельности[ЭлементСтроки] = СтрокаНаправленияДеятельности[ЭлементСтроки] + СтрокаРасходов[ЭлементСтроки];
		КонецЦикла;
			
		СтрокаНаправленияДеятельности.СуммаГод = СтрокаНаправленияДеятельности.СуммаГод + СтрокаРасходов.СуммаГод;
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Процедура ВывестиКартинкуКСтроке(НоваяСтрока, Статус, ЭтоСтатья)
	
	Если ЭтоСтатья Тогда
		КартинкаСтроки = БиблиотекаКартинок.Реквизит;
	Иначе
		КартинкаСтроки = БиблиотекаКартинок.ПриложитьФайл;
	КонецЕсли;
	
	Если Статус = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНайденный() Тогда
		НоваяСтрока.КартинкаСтроки = КартинкаСтроки;
	ИначеЕсли Статус = ЗагрузкаДанныхИзВнешнихФайловКлиентСервер.СтатусНовый() Тогда
		НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.ДобавитьСтраницу;
	Иначе 
		НоваяСтрока.КартинкаСтроки = БиблиотекаКартинок.ВосклицательныйЗнакКрасный;
	КонецЕсли; 
		
КонецПроцедуры 

&НаСервере
Процедура ИзменитьТаблицуБюджета()
	
	Объект.Бюджет.Очистить();  
	
	Для Каждого СтрокаРаздела Из РеквизитФормыВЗначение("ДеревоБюджета").Строки Цикл 
		Если СтрокаРаздела.Раздел = "Финансирование" Тогда 
			Для Каждого СтрокаСтатьиДоходов Из СтрокаРаздела.Строки Цикл 
				НоваяСтрока = Объект.Бюджет.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСтатьиДоходов); 
			КонецЦикла;	
		Иначе
			Для Каждого СтрокаНаправленияДеятельности Из СтрокаРаздела.Строки Цикл 
				Для Каждого СтрокаСтатьиРасходов Из СтрокаНаправленияДеятельности.Строки Цикл 
					НоваяСтрока = Объект.Бюджет.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСтатьиРасходов);
					НоваяСтрока.НаправлениеДеятельности = СтрокаНаправленияДеятельности.НаправлениеДеятельности;
					НоваяСтрока.СтатусНаправленияДеятельности = СтрокаНаправленияДеятельности.СтатусНаправленияДеятельности;
				КонецЦикла;	  
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаДублирующиеЭлементы(Раздел, Отказ)
	
	Таблица = Объект.Бюджет.Выгрузить(Новый Структура("Раздел", Раздел));
	Таблица.Колонки.Добавить("Количество", ОбщегоНазначения.ОписаниеТипаЧисло(10));
	Таблица.ЗаполнитьЗначения(1, "Количество");
	Если Раздел = "Финансирование" Тогда
		Таблица.Свернуть("СтатьяДДС, НаименованиеСтатьиДДС", "Количество"); 
		ШаблонСообщения = НСтр("ru='Статья ""%1"" указана в разделе Финансирование %2'");
	Иначе
		Таблица.Свернуть("НаправлениеДеятельности, СтатьяДДС, НаименованиеНаправленияДеятельности, НаименованиеСтатьиДДС", "Количество"); 
		ШаблонСообщения = НСтр("ru='Статья ""%1"" указана %2 для направления деятельности ""%3""'");
	КонецЕсли;
		
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Если СтрокаТаблицы.Количество > 1 Тогда  
			ЧислоРаз = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
				СтрокаТаблицы.Количество, "раз, раза, раз");
			Если Раздел = "Финансирование" Тогда
				ШаблонСообщения = НСтр("ru='Статья ""%1"" указана в разделе Финансирование %2'"); 
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаТаблицы.НаименованиеСтатьиДДС, ЧислоРаз);
			Иначе
				ШаблонСообщения = НСтр("ru='Статья ""%1"" указана %2 для направления деятельности ""%3""'");
				ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаТаблицы.СтатьяДДС, ЧислоРаз, СтрокаТаблицы.НаправлениеДеятельности);
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область ЗагрузкаДанныхИзФайла
&НаСервере
Функция ЗагрузитьНаСервере()
	
	Если МодификацияДерево Тогда
		ИзменитьТаблицуБюджета();
	КонецЕсли;   
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Бюджет", Объект.Бюджет.Выгрузить());
	ПараметрыЗадания.Вставить("Документ", ДокументБюджета); 
	ПараметрыЗадания.Вставить("ЭтоКорректировка", НужнаКорректировка);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Загрузка данных файла.'");
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"Обработки.ЗагрузкаБюджетаИзФайла.ЗагрузитьДанныеФайла",
		ПараметрыЗадания, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаДанныхИзФайлаЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		Ошибки = ОшибкиПослеЗагрузки(ДлительнаяОперация.АдресРезультата);
		Если ЗначениеЗаполнено(Ошибки) Тогда
			ТекстПредупреждения = НСтр("ru = 'При загрузке данных произошли ошибки.'");
			ПоказатьПредупреждение(, ТекстПредупреждения);
			ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);	
		Иначе	
			ПоказатьОповещениеПользователя(НСтр("ru = 'Загрузка бюджета успешно произведена.'"), , , БиблиотекаКартинок.ВыполненоУспешно);
			ОповеститьОбИзменении(Тип("ДокументСсылка.Бюджет"));
			Если НужнаКорректировка Тогда 
				ДокументКорректировки = ДокументКорректировкиПослеЗагрузки(ДлительнаяОперация.АдресРезультата);
				ПараметрыФормы = Новый Структура("ДокументСсылка", ДокументКорректировки);
				ОткрытьФорму("Обработка.КорректировкаБюджета.Форма.Форма", ПараметрыФормы);
				Оповестить("Запись_КорректировкаБюджета", , ДокументКорректировки);
			Иначе 
				Оповестить("Запись_КорректировкаБюджета", , ДокументБюджета);	
			КонецЕсли;
			Закрыть(); 
		КонецЕсли;
	ИначеЕсли ДлительнаяОперация.Статус = "Ошибка" Тогда
		ВызватьИсключение ДлительнаяОперация.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОшибкиПослеЗагрузки(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Возврат Результат.Ошибки;
	
КонецФункции 

&НаСервереБезКонтекста
Функция ДокументКорректировкиПослеЗагрузки(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	Возврат Результат.ДокументКорректировки;
	
КонецФункции
#КонецОбласти

#Область ПрочиеСлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ПослеВопросаОПереходеНаПервыйШаг(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ТабличнаяЧастьИзменена = Ложь;
		ИзменитьШаг("Шаг1");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОписаниеКолонокВоВременномХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(ОписаниеКолонок.Выгрузить()); 
	
КонецФункции

&НаКлиенте
Процедура РассчитатьИтоги(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоБюджета.ТекущиеДанные;
	РазделДоходы = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторДоходы);
	РазделРасходы = ДеревоБюджета.НайтиПоИдентификатору(ИдентификаторРасходы);
	
	Если ТекущиеДанные.Раздел = "Финансирование" Тогда
		РассчитатьСуммуЗаГодПоСтроке(ТекущиеДанные);
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Пока Родитель <> РазделДоходы Цикл
			РассчитатьИтогиПоРазделу(Родитель);
			Родитель = Родитель.ПолучитьРодителя();
		КонецЦикла;
		РассчитатьИтогиПоРазделу(РазделДоходы);
	ИначеЕсли ТекущиеДанные.ЭтоНаправлениеДеятельности Тогда
		РассчитатьИтогиПоРазделу(РазделРасходы);
	ИначеЕсли ТекущиеДанные.ЭтоСтатьяДДС Тогда
		РассчитатьСуммуЗаГодПоСтроке(ТекущиеДанные);
		Родитель = ТекущиеДанные.ПолучитьРодителя();
		Пока Родитель <> РазделРасходы Цикл
			РассчитатьИтогиПоРазделу(Родитель);
			Родитель = Родитель.ПолучитьРодителя();
		КонецЦикла;
		РассчитатьИтогиПоРазделу(РазделРасходы);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура РассчитатьСуммуЗаГодПоСтроке(Строка)
	
	СуммаГод = 0;
	Для НомерПериода = 1 По КоличествоПериодов Цикл
		СуммаГод = СуммаГод + Строка[СтрШаблон("%1%2", ИмяПериода, НомерПериода)];
	КонецЦикла;
	
	Строка.СуммаГод = СуммаГод;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогиПоРазделу(Раздел)
	
	Раздел.СуммаГод = 0;
	Для НомерПериода = 1 По КоличествоПериодов Цикл
		Раздел[СтрШаблон("%1%2", ИмяПериода, НомерПериода)] = 0;
	КонецЦикла;
		
	Для Каждого Строка Из Раздел.ПолучитьЭлементы() Цикл
		Раздел.СуммаГод = Раздел.СуммаГод + Строка.СуммаГод;
		СуммаДетализации = 0;
		
		Для НомерПериода = 1 По КоличествоПериодов Цикл 
			ЭлементСтроки = СтрШаблон("%1%2", ИмяПериода, НомерПериода);
			Раздел[ЭлементСтроки] = Раздел[ЭлементСтроки] + Строка[ЭлементСтроки]; 
			СуммаДетализации = СуммаДетализации + Раздел[ЭлементСтроки];
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
